In [1]:
import pandas as pd 

data = {
        "Id_producto": [1001, 1002, 1003, 1003],
        "Cantidad_vendida": [30, None, 25, 25],
        "Precio": [20.5, 15.0, None, 22.5]
       }

df = pd.DataFrame(data)
df

   Id_producto  Cantidad_vendida  Precio
0         1001              30.0    20.5
1         1002               NaN    15.0
2         1003              25.0     NaN
3         1003              25.0    22.5

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Id_producto       4 non-null      int64
 1   Cantidad_vendida  3 non-null      float64
 2   Precio            3 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 228.0 bytes

In [3]:
# Esto suma todos los valores nulos que haya en cada serie
df.isnull().sum()

Id_producto         0
Cantidad_vendida    1
Precio              1
dtype: int64

In [5]:
# Esto elimina todos las filas con datos nulos
df_eliminados = df.dropna()
df_eliminados

   Id_producto  Cantidad_vendida  Precio
0         1001              30.0    20.5
3         1003              25.0    22.5

In [8]:
# Asi rellenamos los huecos que sean nulos
valores_nuevos = {"Cantidad_vendida": 0, "Precio": df["Precio"].mean()}
df_rellenados = df.fillna(valores_nuevos)
df_rellenados

   Id_producto  Cantidad_vendida     Precio
0         1001              30.0  20.500000
1         1002               0.0  15.000000
2         1003              25.0  19.333333
3         1003              25.0  22.500000

In [9]:
# Para cambiar el tipo de dato de una serie
df_rellenados["Cantidad_vendida"] = df_rellenados["Cantidad_vendida"].astype(int)
df_rellenados

   Id_producto  Cantidad_vendida     Precio
0         1001                30  20.500000
1         1002                 0  15.000000
2         1003                25  19.333333
3         1003                25  22.500000

In [10]:
# Para eliminar filas que esten exactamente duplicadas, que en este caso no hay porque fila 2 y 3 son iguales en todo menos en precio
df_unicos = df_rellenados.drop_duplicates()
df_unicos

   Id_producto  Cantidad_vendida     Precio
0         1001                30  20.500000
1         1002                 0  15.000000
2         1003                25  19.333333
3         1003                25  22.500000

In [11]:
# Para eliminar duplicados que haya en una serie
df_unicos = df_rellenados.drop_duplicates(subset = "Id_producto")
df_unicos

   Id_producto  Cantidad_vendida     Precio
0         1001                30  20.500000
1         1002                 0  15.000000
2         1003                25  19.333333

In [19]:
data = {
    'ID': [1, 2, 3, 4],
    'Producto': ['Producto A', 'Producto B', 'Producto C', 'Producto D'],
    'Cantidad': [10, 20, 30, 40],
    'Precio': [100, None, 300, None]
}
df = pd.DataFrame(data)

df_sin_nulos = df.fillna({'Precio': df['Precio'].mean()})

df_sin_nulos

   ID    Producto  Cantidad  Precio
0   1  Producto A        10   100.0
1   2  Producto B        20   200.0
2   3  Producto C        30   300.0
3   4  Producto D        40   200.0

## Filtrado de series

In [20]:
serie = pd.Series([5, 10, 15, 20, 25])
serie

0     5
1    10
2    15
3    20
4    25
dtype: int64

In [21]:
filtro = serie > 15
serie_filtrada = serie[filtro]
serie_filtrada

3    20
4    25
dtype: int64

In [22]:
filtro

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [2]:
import pandas as pd
serie4 = pd.Series(['Banana', 'pera', 'melon', 'manzana'])
serie4

0     Banana
1       pera
2      melon
3    manzana
dtype: object

In [3]:
filtro2 = serie4.str.contains('m')
filtro2

0    False
1    False
2     True
3     True
dtype: bool

In [4]:
serie4[filtro2]

2      melon
3    manzana
dtype: object

In [8]:
import pandas as pd 

frutas = pd.Series(["manzana", "banana", "cereza", "durazno", "frambuesa"])

filtros_con_e = frutas.str.contains('e')

frutas[filtros_con_e]

2       cereza
4    frambuesa
dtype: object